Revit 2024 API
RebarHostData.GetFabricAreasInHost Method
 Returns all FabricArea elements hosted by the referenced element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public IList<FabricArea> GetFabricAreasInHost()
Visual Basic
Public Function GetFabricAreasInHost As IList(Of FabricArea)
Visual C++
public:
IList<FabricArea^>^ GetFabricAreasInHost()
See Also
RebarHostData Class
Autodesk.Revit.DB.Structure Namespace